// Задача 6. Узагальнені типи (файл task-6.ts)
// Функція getFirstElement приймає масив і повертає його перший елемент.
// Завдання:
// 1. Зроби функцію узагальненою, використовуючи тип T, щоб вона працювала з масивами будь-якого типу.
// 2.Додай явну типізацію дженериків у виклики функцій.
// 3.Переконайся, що тип елемента, який повертається, точно відповідає типу елементів у масиві.
// 4.Перевір, що TypeScript не дозволяє передати масив змішаних типів без відповідного типу.

function getFirstElement<T>(arr: T[]): T {
  return arr[0];
}
getFirstElement<number>([1, 2, 3]);
getFirstElement<string>(["a", "b", "c"]);
getFirstElement<boolean>([true, false, true]);
